{
    "about" : 
    {
        "intro" : "Nguyen's speaking 🫘", 
        "description" : [
            "CS + Math at Drexel, surviving solely on cold brew ☕",
            "I enjoy working with real-time algorithms and mathematical analysis to optimize software & hardware systems. I also love developing scalable, accessible applications that solve real-world problems effectively.",
            "This summer, I’m working as a research assistant under Professor Jeremy Johnson, focusing on sparse matrix computations in C++ as part of high-performance computing research. Previously, I interned in robotics at Fulbright University Vietnam in 2023 and represented Vietnam at the 2022 World Robot Olympiad.",
            "Under some random rabbit hole, you may catch me volunteering in Powelton or Old City, throwing some paints and brushes, wandering for a new cold brew shop, or writing a 5-page essay on my recently obsessed song. And if not, I’m probably cooking my mom’s Pho recipe.",
            "Find me through <a href='khanhnguyentrinhthi@gmail.com' target='_blank'>email</a>, <a href='https://www.linkedin.com/in/nguyenttk/' target='_blank'>LinkedIn</a>, or <a href='https://github.com/nguyen-trinhtk' target='_blank'>GitHub</a>, and check out <a href='https://read.cv/nguyentrinhtk' target='_blank'>my CV</a>!"
        ]
    }, 
    "projects" : 
    {
        "serious" : 
        {
            "intro" : "Here are some projects I've been working on...",
            "projects" : [
                {
                    "name" : "Pill Reminder",
                    "img" : "pillreminder.png",
                    "description" : "A smart medication management system designed to assist elderly individuals with dementia by automatically scanning prescriptions and dispensing precise doses at the right time.",
                    "skills" : ["flutter", "flask", "arduino", "gemini-api"],
                    "link" : "https://github.com/nguyen-trinhtk/pill-reminder"
                }, 
                {
                    "name" : "Drexel Diet",
                    "img" : "dining.png",
                    "description" : "A live-updating dining app tailored for Drexel University students, offering personalized meal plans based on the dining hall's menu to support healthy eating and meal planning.",
                    "skills" : ["flutter", "webscraping", "firebase"], 
                    "link" : "https://github.com/nguyen-trinhtk/drexel-diet-app"
                },
                {
                    "name" : "PAL",
                    "img" : "pal.png",
                    "description" : "A colorblind-friendly palette generator featuring a built-in colorblindness simulator, contrast checker, and color converter to ensure accessibility in design.",
                    "skills" : ["react-native", "expo", "k-means clustering"],
                    "link" : "https://github.com/nguyen-trinhtk/PAL"

                },
                {
                    "name" : "PII Robot",
                    "img" : "robot.png",
                    "description" : "A trash-collecting robot with automated navigation & obstacle avoidance, along with trash (bottles) detection, classification & collection",
                    "skills" : ["opencv", "lidar", "arduino", "yolov5"],
                    "link" : "https://github.com/nguyen-trinhtk/pill-reminder"
                }
            ]
        }, 
        "fun" :    
        {
            "intro" : "and some more funsies...",
            "projects" : [
                {
                    "name" : "Tuk the Virtual Monkey",
                    "img" : "tuk.png",
                    "description" : "A finite-state virtual pet with multiple emotions and interactions, developed using Tranquility, a custom programming language created by Professor Brian Stuart for CS-164.",
                    "skills" : ["html", "css", "js", "tranquility"],
                    "link" : "https://github.com/nguyen-trinhtk/cs164-virtual-pet"
                }, 
                {
                    "name" : "Mr. Discipline",
                    "img" : "discord.png",
                    "description" : "A versatile Discord bot designed to assist students by playing music, setting timers, taking notes, and creating quizzes for better productivity.",
                    "skills" : ["python", "discord api", "spotify api"],
                    "link" : "https://github.com/nguyen-trinhtk/mr-discipline"
                }, 
                {
                    "name" : "Euphoniter",
                    "img" : "euphoniter.png",
                    "description" : "An online platform dedicated to music enthusiasts, featuring music reviews, artist biographies, and insights into music theory. My first web development project!",
                    "skills" : ["html", "css", "js"],
                    "link" : "https://github.com/nguyen-trinhtk/pill-reminder"
                }, 
                {
                    "name" : "Spotify Analyzer",
                    "img" : "spotify.png",
                    "description" : "A Python script that analyzes Spotify listening history (JSON) to generate insights such as top songs, favorite artists, and total listening time, inspired by Spotify Wrapped.",
                    "skills" : ["python", "regex", "json"],
                    "link" : "https://github.com/nguyen-trinhtk/pill-reminder"
                }
            ]
        }
    },
    "thoughts" : 
    {
        "intro" : "This may be random, but...",
        "thoughts" : [
            {
                "date" : "May 16, 2025",
                "title" : "First thoughts",
                "content" : "Finally, my portfolio is done. I made at least 4 version (with 4 distinctive designs) and never got any of them officially finished. I will not think of another idea. [saying to myself] This is good enough >:( "
            }
        ]
    }
}